clear; clc;
RDK = Robolink;
robot = RDK.Item('UR5');
if ~robot.Valid(), error('Robot not found!'); end

% Твои сохраненные точки
P = cell(1, 8);
P{1} = [-6.123e-17 6.123e-17 1 474.5;-1 -1.225e-16 -6.123e-17 -109.3;1.225e-16 -1 6.123e-17 609;0 0 0 1];
P{2} = [-2.22e-16 2.225e-15 1 474.5;-1 -4.67e-16 -2.22e-16 195.7;4.617e-16 -1 2.227e-15 609;0 0 0 1];
P{3} = [6.106e-16 2.353e-15 1 474.5;-1 -4.093e-16 6.106e-16 195.7;3.045e-16 -1 2.408e-15 404;0 0 0 1];
P{4} = [2.158e-15 3.78e-15 1 474.5;-1 -7.425e-17 2.158e-15 -104.3;7.424e-17 -1 3.836e-15 404;0 0 0 1];
P{5} = [2.609e-15 4.5e-15 1 224.5;-1 3.587e-17 2.595e-15 -104.3;-3.796e-17 -1 4.555e-15 404;0 0 0 1];
P{6} = [-1.249e-15 4.497e-15 1 224.5;-1 -3.666e-15 -1.305e-15 200.7;3.687e-15 -1 4.502e-15 404;0 0 0 1];
P{7} = [-3.969e-15 4.346e-15 1 224.5;-1 -5.123e-15 -3.997e-15 200.7;5.16e-15 -1 4.341e-15 603.9;0 0 0 1];
P{8} = [-2.29e-15 4.831e-15 1 224.5;-1 -5.106e-15 -2.29e-15 -99.3;5.103e-15 -1 4.878e-15 604;0 0 0 1];

% Маршрут: последовательно от 1 до 8 и возврат в 1
order = [1, 2, 3, 4, 5, 6, 7, 8, 1];

% Настройки визуализации
RDK.Command('TraceSize', '1'); % Тонкая линия
RDK.Command('Trace', 'On');    % Включить след
RDK.Command('Trace', 'Reset'); % Очистить старое

steps = 60; 

disp('Запуск траектории...');

for k = 1:(length(order) - 1)
    T_start = P{order(k)};
    T_end   = P{order(k+1)};
    
    pos_start = T_start(1:3, 4);
    pos_end   = T_end(1:3, 4);
    delta_pos = (pos_end - pos_start) / steps;
    R_fixed   = T_start(1:3, 1:3);

    for i = 1:steps
        curr_xyz = pos_start + delta_pos * i;
        T_curr = eye(4);
        T_curr(1:3, 1:3) = R_fixed;
        T_curr(1:3, 4)   = curr_xyz;
        
        q_new = robot.SolveIK(T_curr);
        
        % Двигаем только если решение найдено
        if ~isempty(q_new)
            robot.setJoints(q_new(1,:));
        end
        pause(0.01); 
    end
end

disp('Путь пройден, робот вернулся в исходную точку.');